doomzzz/dotorg.el
      (require 'org-bullets)
      (org-babel-do-load-languages
       'org-babel-load-languages
       '((emacs-lisp . t)
         (python . t)
         (shell . t)))
      (require 'ob-shell)
      (require 'ox-md)
      (doom-themes-org-config)
      (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))

      (setq org-element-use-cache nil)
      (use-package org
        :init
        (setq org-use-speed-commands t
              org-return-follows-link t
              org-hide-emphasis-markers t
              org-completion-use-ido t
              org-agenda-files '("~/cloud/.personal/agenda")
              org-outline-path-complete-in-steps nil
              org-src-fontify-natively t   ;; Pretty code blocks
              org-src-tab-acts-natively t
              org-confirm-babel-evaluate nil
              org-books-file "~/cloud/.personal/my-list.org"
              org-hide-emphasis-markers t))
      (setq org-cycle-separator-lines 2)
 ;;     (setq ("%latex -interaction nonstopmode -output-directory %o %f" "%bib %b"
  ;;     "%latex -interaction nonstopmode -output-directory %o %f" "%latex
   ;;   -interaction nonstopmode -output-directory %o %f")
 ;;)

      (setq org-agenda-files '("home/sole/cloud/.personal/agenda/"))

       (use-package org-agenda
         :after org
         :bind (:map org-agenda-mode-map
                     ("X" . my/org-agenda-mark-done-and-add-followup)
                     ("x" . my/org-agenda-done))
         :preface
         (defun my/org-agenda-done (&optional arg)
           "Mark current TODO as done.
                              This changes the line at point, all other lines in the agenda referring to
                              the same tree node, and the headline of the tree node in the Org-mode file."
           (interactive "P")
           (org-agenda-todo "DONE"))

         (defun my/org-agenda-mark-done-and-add-followup ()
           "Mark the current TODO as done and add another task after it.
                               Creates it at the same level as the previous task, so it's better to use
                               this with to-do items than with projects or headings."
           (interactive)
           (org-agenda-todo "DONE")
           (org-agenda-switch-to)
           (org-capture 0 "t"))
         :custom
         (org-agenda-dim-blocked-tasks t)
         (org-agenda-inhibit-startup t)
         (org-agenda-show-log t)
         (org-agenda-skip-deadline-if-done t)
         (org-agenda-skip-deadline-prewarning-if-scheduled 'pre-scheduled)
         (org-agenda-skip-scheduled-if-done nil)
         (org-agenda-span 2)
         (org-agenda-start-on-weekday 6)
         (org-agenda-sticky nil)
         (org-agenda-tags-column -100)
         (org-agenda-time-grid '((daily today require-timed)))
         (org-agenda-use-tag-inheritance t)
         (org-columns-default-format "%14SCHEDULED %Effort{:} %1PRIORITY %TODO %50ITEM %TAGS")
         (org-default-notes-file "~/cloud/.personal/agenda/organizer.org")
         (org-directory "~/cloud/.personal")
         (org-enforce-todo-dependencies t)
         (org-habit-graph-column 80)
         (org-habit-show-habits-only-for-today nil)
         (org-track-ordered-property-with-tag t))

      (setq reftex-default-bibliography '("~/cloud/.bibstuff/references.bib"))

      (setq org-ref-bibliography-notes "~/cloud/.bibstuff/orgRefNotes.org"
            org-ref-default-bibliography '("~/cloud/.bibstuff/references.bib")
            org-ref-pdf-directory "~/cloud/zotf_ile")

      (setq bibtex-completion-bibliography '("~/cloud/.bibstuff/references.bib")
            bibtex-completion-library-path "~/cloud/zotf_ile"
            bibtex-completion-notes-path "~/cloud/.bibstuff/helm-bibtex-notes")

      (setq bibtex-completion-pdf-field "file")
      (setq bibtex-completion-pdf-open-function
            (lambda (fpath)
              (start-process "evince" "*helm-bibtex-evince*" "/usr/bin/evince"
                             fpath)))
      (setq bibtex-dialect 'biblatex)

      (setq bibtex-completion-format-citation-functions
            '((org-mode      . bibtex-completion-format-citation-org-link-to-PDF)
              (latex-mode    . bibtex-completion-format-citation-cite)
              (markdown-mode . bibtex-completion-format-citation-pandoc-citeproc)
              (default       . bibtex-completion-format-citation-default)))
