doomzzz/dotorg.el

      (use-package org-faces
        :after org
        :custom
        (org-todo-keyword-faces
         '(("DONE" . (:foreground "cyan" :weight bold))
           ("SOMEDAY" . (:foreground "gray" :weight bold))
           ("TODO" . (:foreground "green" :weight bold))
           ("WAITING" . (:foreground "red" :weight bold))
           ("STARTED" . (:foreground "cyan" :weight normal))
           ("NEXT" . (:foreground "cyan" :weight bold)))))

      (let* ((variable-tuple (cond ((x-list-fonts   "Source Sans Pro") '(:font   "Source Sans Pro"))
                                   ((x-list-fonts   "Lucida Grande")   '(:font   "Lucida Grande"))
                                   ((x-list-fonts   "Verdana")         '(:font   "Verdana"))
                                   ((x-family-fonts "Sans Serif")      '(:family "Sans Serif"))
                                   (nil (warn "Cannot find a Sans Serif Font.  Install Source Sans Pro.")))) (base-font-color (face-foreground 'default nil 'default))
                                   (headline       `(:inherit default :weight normal :foreground ,base-font-color)))

        (custom-theme-set-faces
         'user
         `(org-level-8        ((t (,@headline ,@variable-tuple))))
         `(org-level-7        ((t (,@headline ,@variable-tuple))))
         `(org-level-6        ((t (,@headline ,@variable-tuple))))
         `(org-level-5        ((t (,@headline ,@variable-tuple))))
         `(org-level-4        ((t (,@headline ,@variable-tuple :height 1.1))))
         `(org-level-3        ((t (,@headline ,@variable-tuple :height 1.25))))
         `(org-level-2        ((t (,@headline ,@variable-tuple :height 1.5))))
         `(org-level-1        ((t (,@headline ,@variable-tuple :height 1.70))))
         `(org-document-title ((t (,@headline ,@variable-tuple :height 2.0 :underline nil))))))

      (use-package org-clock
        :preface
        (defun my/org-mode-ask-effort ()
          "Ask for an effort estimate when clocking in."
          (unless (org-entry-get (point) "Effort")
            (let ((effort
                   (completing-read
                    "Effort: "
                    (org-entry-get-multivalued-property (point) "Effort"))))
              (unless (equal effort "")
                (org-set-property "Effort" effort)))))
        :hook (org-clock-in-prepare-hook . my/org-mode-ask-effort)
        :custom
        (org-clock-clocktable-default-properties
         '(:block day :maxlevel 2 :scope agenda :link t :compact t :formula %
                  :step day :fileskip0 t :stepskip0 t :narrow 80
                  :properties ("Effort" "CLOCKSUM" "CLOCKSUM_T" "TODO")))
        (org-clock-continuously nil)
        (org-clock-in-switch-to-state "STARTED")
        (org-clock-out-remove-zero-time-clocks t)
        (org-clock-persist t)
        (org-clock-persist-file "~/cloud/.personal/agenda/.clock")
        (org-clock-persist-query-resume nil)
        (org-clock-report-include-clocking-task t)
        (org-show-notification-handler (lambda (msg) (alert msg))))
      ;; global Effort estimate values
      (setq org-global-properties
            '(("Effort_ALL" .
               "0:15 0:30 0:45 1:00 2:00 3:00 4:00 5:00 6:00 0:00")))
      ;; Set default column view headings: Task Priority Effort Clock_Summary
      (setq org-columns-default-format "%50ITEM(Task) %2PRIORITY %10Effort(Effort){:} %10CLOCKSUM")

      (use-package org-mru-clock
        :bind* (("C-c C-x i" . org-mru-clock-in)
                ("C-c C-x C-j" . org-mru-clock-select-recent-task))
        :init
        (setq org-mru-clock-how-many 100
              org-mru-clock-completing-read #'ivy-completing-read))
      (setq org-clock-history-length 23)
      (defun eos/org-clock-in ()
        (interactive)
        (org-clock-in '(4)))
      (global-set-key (kbd "C-c I") #'eos/org-clock-in)
      (global-set-key (kbd "C-c O") #'org-clock-out)
      (org-clock-persistence-insinuate)
      (setq org-clock-persist t)
      (setq org-clock-in-resume t)
      (setq org-clock-persist-query-resume nil)
      (defun meeting-notes ()
        (interactive)
        (outline-mark-subtree)                              ;; Select org-mode section
        (narrow-to-region (region-beginning) (region-end))  ;; Only show that region
        (deactivate-mark)
        (delete-other-windows)                              ;; Get rid of other windows
        (text-scale-set 2)                                  ;; Text is now readable by others
        (fringe-mode 0)
        (message "When finished taking your notes, run meeting-done."))
      (defun meeting-done ()
        (interactive)
        (widen)                                       ;; Opposite of narrow-to-region
        (text-scale-set 0)                            ;; Reset the font size increase
        (fringe-mode 1)
        (winner-undo))
      (defun org-archive-done-tasks ()
        (interactive)
        (org-map-entries
         (lambda ()
           (org-archive-subtree)
           (setq org-map-continue-from (outline-previous-heading)))
         "/DONE" 'agenda))

      (let* ((variable-tuple
              (cond ((x-list-fonts   "Source Sans Pro") '(:font   "Source Sans Pro"))
                    ((x-list-fonts   "Lucida Grande")   '(:font   "Lucida Grande"))
                    ((x-list-fonts   "Verdana")         '(:font   "Verdana"))
                    ((x-family-fonts "Sans Serif")      '(:family "Sans Serif"))
                    (nil (warn "Cannot find a Sans Serif Font.  Install Source Sans Pro."))))
             (base-font-color (face-foreground 'default nil 'default))
             (headline       `(:inherit default :weight normal :foreground ,base-font-color)))

        (custom-theme-set-faces
         'user
         `(org-level-8        ((t (,@headline ,@variable-tuple))))
         `(org-level-7        ((t (,@headline ,@variable-tuple))))
         `(org-level-6        ((t (,@headline ,@variable-tuple))))
         `(org-level-5        ((t (,@headline ,@variable-tuple))))
         `(org-level-4        ((t (,@headline ,@variable-tuple :height 1.1))))
         `(org-level-3        ((t (,@headline ,@variable-tuple :height 1.25))))
         `(org-level-2        ((t (,@headline ,@variable-tuple :height 1.5))))
         `(org-level-1        ((t (,@headline ,@variable-tuple :height 1.70))))
         `(org-document-title ((t (,@headline ,@variable-tuple :height 2.0 :underline nil))))))
      (defun custom-org-cliplink ()
        (interactive)
        (org-cliplink-insert-transformed-title
         (org-cliplink-clipboard-content)     ;take the URL from the CLIPBOARD
         (lambda (url title)
           (let* ((parsed-url (url-generic-parse-url url)) ;parse the url
                  (clean-title
                   (cond
                    ;; if the host is github.com, cleanup the title
                    ((string= (url-host parsed-url) "github.com")
                     (replace-regexp-in-string "GitHub - .*: \\(.*\\)" "\\1" title))
                    ;; otherwise keep the original title
                    (t title))))
             ;; forward the title to the default org-cliplink transformer
             (org-cliplink-org-mode-link-transformer url clean-title)))))

      (add-hook 'org-load-hook
                (lambda ()
                  (define-key org-mode-map "\M-n" 'org-next-link)
                  (define-key org-mode-map "\M-p" 'org-previous-link)))
