doomzzz/dotorg.org
** export
   :PROPERTIES:
   :headers-args: :tangle yes
   :END:
   [[https://endlessparentheses.com/better-time-stamps-in-org-export.html][Better time-stamps in org-export with Emacs · Endless Parentheses]]
   #+begin_src elisp :tangle yes
     (add-to-list 'org-export-filter-timestamp-functions
                  #'endless/filter-timestamp)
     (defun endless/filter-timestamp (trans back _comm)
       "Remove <> around time-stamps."
       (pcase back
         ((or `jekyll `html)
          (replace-regexp-in-string "&[lg]t;" "" trans))
         (`latex
          (replace-regexp-in-string "[<>]" "" trans))))
     #+end_src

     #+RESULTS:
     : endless/filter-timestamp

   #+begin_src elisp :tangle yes
     (setq-default org-display-custom-times t)
     ;;; Before you ask: No, removing the <> here doesn't work.
     (setq org-time-stamp-custom-formats
           '("<%d %b %Y>" . "<%d/%m/%y %a %H:%M>"))
   #+end_src

   #+RESULTS:
   : (<%d %b %Y> . <%d/%m/%y %a %H:%M>)


** functions
   #+BEGIN_SRC elisp :tangle yes
     (defun org-archive-done-tasks ()
       (interactive)
       (org-map-entries
        (lambda ()
          (org-archive-subtree)
          (setq org-map-continue-from (outline-previous-heading)))
        "/DONE" 'agenda))


     (defun custom-org-cliplink ()
       (interactive)
       (org-cliplink-insert-transformed-title
        (org-cliplink-clipboard-content)     ;take the URL from the CLIPBOARD
        (lambda (url title)
          (let* ((parsed-url (url-generic-parse-url url)) ;parse the url
                 (clean-title
                  (cond
                   ;; if the host is github.com, cleanup the title
                   ((string= (url-host parsed-url) "github.com")
                    (replace-regexp-in-string "GitHub - .*: \\(.*\\)" "\\1" title))
                   ;; otherwise keep the original title
                   (t title))))
            ;; forward the title to the default org-cliplink transformer
            (org-cliplink-org-mode-link-transformer url clean-title)))))
   #+END_SRC

   #+begin_src elisp :tangle yes
     ;; private interactive functions
     (defun occur-non-ascii ()
       "Find any non-ascii characters in the current buffer."
       (interactive)
       (occur "[^[:ascii:]]"))
     (defun find-first-non-ascii-char ()
       "Find the first non-ascii character from point onwards."
       (interactive)
       (let (point)
         (save-excursion
           (setq point
                 (catch 'non-ascii
                   (while (not (eobp))
                     (or (eq (char-charset (following-char))
                             'ascii)
                         (throw 'non-ascii (point)))
                     (forward-char 1)))))
         (if point
             (goto-char point)
           (message "No non-ascii characters."))))
     (defun toggle-maximize-buffer () "Maximize buffer" (interactive) (if (= 1 (length (window-list)))
                                                                          (jump-to-register '_)
                                                                        (progn
                                                                          (window-configuration-to-register '_)
                                                                          (delete-other-windows))))
     (defun my-expand-file-name-at-point ()
       "Use hippie-expand to expand the filename"
       (interactive)
       (let ((hippie-expand-try-functions-list
              '(try-complete-file-name-partially
                try-complete-file-name)))
         (call-interactively 'hippie-expand)))
     (global-set-key (kbd "C-M-/") 'my-expand-file-name-at-point)
     (defun org-toggle-link-display ()
       "Toggle the literal or descriptive display of links."
       (interactive)
       (if org-descriptive-links
           (progn (org-remove-from-invisibility-spec '(org-link))
                  (org-restart-font-lock)
                  (setq org-descriptive-links nil))
         (progn (add-to-invisibility-spec '(org-link))
                (org-restart-font-lock)
                (setq org-descriptive-links t))))

   #+end_src
   #+RESULTS:
   : custom-org-cliplink


*** more functions
    :properties:
    :headers-args: :tangle yes :results output
    :end:
**** TODO wrap text in an org mode block 
     [[http://pragmaticemacs.com/emacs/wrap-text-in-an-org-mode-block/][Wrap text in an org-mode block | Pragmatic Emacs]]
     #+begin_src elisp 
       (defun org-begin-template ()
         "Make a template at point."
         (interactive)
         (if (org-at-table-p)
             (call-interactively 'org-table-rotate-recalc-marks)
           (let* ((choices '(("s" . "src")
                             ("e" . "example")
                             ("q" . "quote")
                             ("v" . "verse")
                             ("c" . "center")
                             ("l" . "lAtEx")
                             ("h" . "html")
                             ("a" . "ascii")))
                  (key
                   (key-description
                    (vector
                     (read-key
                      (concat (propertize "Template type: " 'face 'minibuffer-prompt)
                              (mapconcat (lambda (choice)
                                           (concat (propertize (car choice) 'face 'font-lock-type-face)
                                                   ": "
                                                   (cdr choice)))
                                         choices
                                         ", ")))))))
             (let ((result (assoc key choices)))
               (when result
                 (let ((choice (cdr result)))
                   (cond
                    ((region-active-p)
                     (let ((start (region-beginning))
                           (end (region-end)))
                       (goto-char end)
                       (insert "#+end_" choice "\n")
                       (goto-char start)
                       (insert "#+begin_" choice "\n")))
                    (t
                     (insert "#+begin_" choice "\n")
                     (save-excursion (insert "#+end_" choice))))))))))

       ;;bind to key
       (define-key org-mode-map (kbd "C-<") 'org-begin-template)
     #+end_src

     #+RESULTS:
     : org-begin-template


** packages
   

*** org-books                                                 :broken:notang:
    :PROPERTIES:
    :headers-args: :tangle no :results output
    :END:
    - needs :: enlive - [[enlive]] 
**** setup
     https://github.com/lepisma/org-books

     #+begin_src elisp 
       (setq org-books-file "~/cloud/.personal/my-list.org")
     #+end_src
*** org-noter                                                  :melpa:notang:
    :PROPERTIES:
    :headers-args: :tangle no :results output
    :END:
   
**** basic 
     note :: mostly from [[*org-noter etc][org-noter etc]]
     #+begin_src elisp :tangle no :results silent
       (use-package org-noter
         :after org
         :ensure t)
     #+end_src


     #+begin_src elisp :tangle no :results silent
       (setq org-noter-default-notes-file-names '("~/cloud/.personal/notes/noter.org")
             org-noter-notes-search-path '("~/cloud/.personal"))
       (setq org-noter-separate-notes-from-heading t)
     #+end_src

*** org clip link                                                     :melpa:

**** basics
     https://github.com/rexim/org-cliplink
     #+begin_src elisp 
       (global-set-key (kbd "C-x p i") 'org-cliplink)
       (load-theme 'doom-nord t)
     #+end_src

    
**** custom 
     Custom Transformers You can actually customize how org-cliplink transforms and
     inserts url and title to the current buffer. To do that use
     org-cliplink-insert-transformed-title function. It takes the URL and a CALLBACK
     which is invoked when the title is retrieved.

     For example, if you want to strip off Github - <description>: from the GitHub
     titles you can implement the following custom-org-cliplink function and use it
     instead of the original org-cliplink:

     #+begin_src elisp 
       (defun custom-org-cliplink ()
         (interactive)
         (org-cliplink-insert-transformed-title
          (org-cliplink-clipboard-content)     ;take the URL from the CLIPBOARD
          (lambda (url title)
            (let* ((parsed-url (url-generic-parse-url url)) ;parse the url
                   (clean-title
                    (cond
                     ;; if the host is github.com, cleanup the title
                     ((string= (url-host parsed-url) "github.com")
                      (replace-regexp-in-string "GitHub - .*: \\(.*\\)" "\\1" title))
                     ;; otherwise keep the original title
                     (t title))))
              ;; forward the title to the default org-cliplink transformer
              (org-cliplink-org-mode-link-transformer url clean-title)))))
     #+end_src

*** toc-org                                                           :melpa:
    :PROPERTIES:
    :headers-args: :tangle yes :results output
    :END:
    #+begin_src elisp :tangle yes
      (if (require 'toc-org nil t)
          (add-hook 'org-mode-hook 'toc-org-mode)
        (warn "toc-org not found"))
    #+end_src
    [[https://github.com/snosov1/toc-org][GitHub - snosov1/toc-org: toc-org is an Emacs utility to have an up-to-date t...]] 

    After the installation, every time you’ll be saving an org file, the first
    headline with a :TOC: tag will be updated with the current table of contents.

*** TODO org-web-tools                                                :melpa:
    :PROPERTIES:
    :GH:       https://github.com/alphapapa/org-web-tools
    :headers-args: :tangle yes :results output
    :END:

**** minimal
     #+begin_src elisp
       (require 'org-web-tools)
     #+end_src
     org-web-tools--url-as-readable-org
     #+RESULTS:
     : org-web-tools

*** TODO org web
   https://github.com/DanielDe/org-web 


** capture stuff

*** links :: howardism
    - link :: [[http://www.howardism.org/Technical/Emacs/capturing-intro.html][Org Capturing Introduction]]

* ressources:
** org-clock
   add entry after done:
   https://emacs.stackexchange.com/questions/30280/how-to-conveniently-insert-a-clock-entry
   timestamps:
   https://emacs.stackexchange.com/questions/12130/how-to-insert-inactive-timestamp-via-function

** org-noter etc
   https://write.as/dani/notes-on-org-noter Org noter defines a default note
   file, where new headings are included for documents that do not have a file
   associated with them. By default this file is called Notes.org. Because I
   don't like files that start with capitals, I rename it to notes.org. Org
   noter also requires a search path (or multiple) to search for document notes
   when M-x org-noter is called from a pdf document. By default, that is
   ~/Documents, but I prefer to have it in a dedicated version controlled
   directory ~/org/Research-Notes.

** custom id
   https://writequit.org/articles/emacs-org-mode-generate-ids.html

** export -publish
 https://gohugo.io   
 ox-hugo
** other orgs
   https://ivanmalison.github.io/dotfiles/#orgprojectile

* TODO bugs

** org-preserve local variable
   <2019-06-18 Tue 20:35> 

    

   

* kitchen group
https://kitchingroup.cheme.cmu.edu/blog/2015/07/28/A-highlight-annotation-mode-for-Emacs-using-font-lock/

* NEXT refile 
  https://www.reddit.com/r/emacs/comments/4366f9/how_do_orgrefiletargets_work/
  #+begin_src elisp
(setq org-agenda-files (list "~/cloud/.personal/agenda"))
    (setq org-refile-targets (quote (("~/cloud/.personal/notes/orgmode.org" :maxlevel . 1)
                                     (nil :maxlevel . 3)
                                     (org-agenda-files :maxlevel . 3))))
    (setq org-outline-path-complete-in-steps t)         ; Refile in a single go
    (setq org-refile-use-outline-path t)                  ; Show full paths for refiling                                    ("~/cloud/.personal/agenda" :level . 2))))
  #+end_src

  #+RESULTS:
  : t


