doomzzz/dotorg.el

     (add-to-list 'org-export-filter-timestamp-functions
                  #'endless/filter-timestamp)
     (defun endless/filter-timestamp (trans back _comm)
       "Remove <> around time-stamps."
       (pcase back
         ((or `jekyll `html)
          (replace-regexp-in-string "&[lg]t;" "" trans))
         (`latex
          (replace-regexp-in-string "[<>]" "" trans))))

     (setq-default org-display-custom-times t)
     ;;; Before you ask: No, removing the <> here doesn't work.
     (setq org-time-stamp-custom-formats
           '("<%d %b %Y>" . "<%d/%m/%y %a %H:%M>"))

     (defun org-archive-done-tasks ()
       (interactive)
       (org-map-entries
        (lambda ()
          (org-archive-subtree)
          (setq org-map-continue-from (outline-previous-heading)))
        "/DONE" 'agenda))


     (defun custom-org-cliplink ()
       (interactive)
       (org-cliplink-insert-transformed-title
        (org-cliplink-clipboard-content)     ;take the URL from the CLIPBOARD
        (lambda (url title)
          (let* ((parsed-url (url-generic-parse-url url)) ;parse the url
                 (clean-title
                  (cond
                   ;; if the host is github.com, cleanup the title
                   ((string= (url-host parsed-url) "github.com")
                    (replace-regexp-in-string "GitHub - .*: \\(.*\\)" "\\1" title))
                   ;; otherwise keep the original title
                   (t title))))
            ;; forward the title to the default org-cliplink transformer
            (org-cliplink-org-mode-link-transformer url clean-title)))))

     ;; private interactive functions
     (defun occur-non-ascii ()
       "Find any non-ascii characters in the current buffer."
       (interactive)
       (occur "[^[:ascii:]]"))
     (defun find-first-non-ascii-char ()
       "Find the first non-ascii character from point onwards."
       (interactive)
       (let (point)
         (save-excursion
           (setq point
                 (catch 'non-ascii
                   (while (not (eobp))
                     (or (eq (char-charset (following-char))
                             'ascii)
                         (throw 'non-ascii (point)))
                     (forward-char 1)))))
         (if point
             (goto-char point)
           (message "No non-ascii characters."))))
     (defun toggle-maximize-buffer () "Maximize buffer" (interactive) (if (= 1 (length (window-list)))
                                                                          (jump-to-register '_)
                                                                        (progn
                                                                          (window-configuration-to-register '_)
                                                                          (delete-other-windows))))
     (defun my-expand-file-name-at-point ()
       "Use hippie-expand to expand the filename"
       (interactive)
       (let ((hippie-expand-try-functions-list
              '(try-complete-file-name-partially
                try-complete-file-name)))
         (call-interactively 'hippie-expand)))
     (global-set-key (kbd "C-M-/") 'my-expand-file-name-at-point)
     (defun org-toggle-link-display ()
       "Toggle the literal or descriptive display of links."
       (interactive)
       (if org-descriptive-links
           (progn (org-remove-from-invisibility-spec '(org-link))
                  (org-restart-font-lock)
                  (setq org-descriptive-links nil))
         (progn (add-to-invisibility-spec '(org-link))
                (org-restart-font-lock)
                (setq org-descriptive-links t))))

      (if (require 'toc-org nil t)
          (add-hook 'org-mode-hook 'toc-org-mode)
        (warn "toc-org not found"))
